In [13]:
import numpy as np
print("meep")

meep

In [1]:
import pandas as pd
print("meep")

meep

In [3]:
school_data_to_load = "../Resources/schools_complete.csv"
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [4]:
bob = school_data_df.set_index(["school_name"])[["type", "size", "budget"]]
bob.index.name = None
bob

                           type  size   budget
Huang High School      District  2917  1910635
Figueroa High School   District  2949  1884411
Shelton High School     Charter  1761  1056600
Hernandez High School  District  4635  3022020
Griffin High School     Charter  1468   917500
Wilson High School      Charter  2283  1319574
Cabrera High School     Charter  1858  1081356
Bailey High School     District  4976  3124928
Holden High School      Charter   427   248087
Pena High School        Charter   962   585858
Wright High School      Charter  1800  1049400
Rodriguez High School  District  3999  2547363
Johnson High School    District  4761  3094650
Ford High School       District  2739  1763916
Thomas High School      Charter  1635  1043130

In [21]:
bob.loc[(bob["size"] < 2000) & (bob["budget"] > 17), "budget"] = np.nan

In [19]:
bob.loc[(bob["size"] < 2000)].count()["type"]

2

In [24]:
bob[bob["budget"] <= 18].count()

type      2
size      2
budget    2
dtype: int64

In [25]:
bob

                           type  size     budget
Huang High School      District  2917  1910635.0
Figueroa High School   District  2949  1884411.0
Shelton High School         NaN  1761        NaN
Hernandez High School  District  4635  3022020.0
Griffin High School         NaN  1468        NaN
Wilson High School      Charter  2283  1319574.0
Cabrera High School         NaN  1858        NaN
Bailey High School     District  4976  3124928.0
Holden High School       locked    17       17.0
Pena High School         locked    17       17.0
Wright High School          NaN  1800        NaN
Rodriguez High School  District  3999  2547363.0
Johnson High School    District  4761  3094650.0
Ford High School       District  2739  1763916.0
Thomas High School          NaN  1635        NaN

In [ ]:
school_data_df["per_cap"] = school_data_df["budget"] / school_data_df["size"]
school_data_df

In [ ]:
spending_bins = [0, 585, 615, 645, 675]

In [ ]:
school_data_df["per_cap"]

In [ ]:
joe = pd.cut(school_data_df["per_cap"], spending_bins)
type(joe)

In [ ]:
school_data_df["per_cap_bin"] = joe
school_data_df

In [ ]:
school_data_df.groupby("per_cap_bin").count()

In [ ]:
type(585858/962)

In [ ]:
colnam = "budget"
colform = "${:,.2f}"

In [ ]:
school_data_df[colnam] = school_data_df[colnam].map(colform.format)
school_data_df

In [ ]:
school_data_df.dtypes

In [ ]:
"wm_"+'math_score'

In [26]:
cat = [True, False, np.nan]

In [89]:
catt = pd.DataFrame(cat)

In [97]:
catt["boring"] = [2,1,2]

In [98]:
catt

       0  boring
0   True       2
1  False       1
2    NaN       2

In [99]:
catt.groupby(["boring"]).mean()

          0
boring
1       0.0
2       1.0

In [102]:
catt[0] = pd.to_numeric(catt[0])

In [104]:
catt.dtypes

0         float64
boring      int64
dtype: object

In [32]:
list(school_data_df.columns)

['School ID', 'school_name', 'type', 'size', 'budget']

In [40]:
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [35]:
416/12194

0.03411513859275053

In [39]:
fixed = pd.Series([90.3, 93.1, 87.2])
unfixed = pd.Series([0.936208, 0.965865, 0.904322])
100*unfixed - fixed

0    3.3208
1    3.4865
2    3.2322
dtype: float64

In [41]:
93.2722 - 66.911315

26.360884999999996

In [42]:
416/1635

0.25443425076452597

In [62]:
student_data_to_load = "../Resources/students_complete.csv"
student_data_df = pd.read_csv(student_data_to_load)
thoma = student_data_df[student_data_df["school_name"] == "Thomas High School"].copy()
thoma

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
37535,37535,Norma Mata,F,10th,Thomas High School,76,76
37536,37536,Cody Miller,M,11th,Thomas High School,84,82
37537,37537,Erik Snyder,M,9th,Thomas High School,80,90
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,69
37539,37539,Noah Erickson,M,9th,Thomas High School,86,76
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [63]:
passing_math = thoma["math_score"] >= 70
passing_reading = thoma["reading_score"] >= 70

# this is not the right place for display names of columns:
# until we group-by school, they aren't precentages!
thoma["pass_math"] = passing_math
thoma["pass_reading"] = passing_reading
thoma["pass_both"] = passing_math & passing_reading
thoma["ctr"] = True

thoma = thoma[["grade", "pass_math", "pass_reading", "pass_both", "ctr"]]

In [72]:
grue = thoma.groupby(["grade"]).sum()
grue

       pass_math  pass_reading  pass_both  ctr
grade
10th         396           411        387  421
11th         384           403        374  415
12th         314           325        303  338
9th          431           452        423  461

In [70]:
thoma

      grade  pass_math  pass_reading  pass_both   ctr
37535  10th       True          True       True  True
37536  11th       True          True       True  True
37537   9th       True          True       True  True
37538   9th      False          True      False  True
37539   9th       True          True       True  True
...     ...        ...           ...        ...   ...
39165  12th       True          True       True  True
39166  10th       True          True       True  True
39167   9th       True          True       True  True
39168  10th       True          True       True  True
39169  11th       True          True       True  True

[1635 rows x 5 columns]

In [73]:
mess = pd.merge(thoma, grue, 
               how="left", on=["pass_both", "pass_both"])

In [84]:
mess["pass_math_y"].isna()

0       True
1       True
2       True
3       True
4       True
        ...
1630    True
1631    True
1632    True
1633    True
1634    True
Name: pass_math_y, Length: 1635, dtype: bool